Repository: iamamofa/FlutterScreens--
Catalog: swift ui/Fit-Vein/Fit Vein/*.lproj/Localizable.strings
Languages: pl

# Onboarding_welcome_title
source: Welcome!
pl: Witaj!

# Onboarding_welcome_description
source: Let us walk you throught the most vital parts of the app or just dismiss this onboarding and dive right in.
pl: Poznaj najważniejsze funkcje aplikacji lub zacznij korzystać już teraz.

# Onboarding_home_tab_view_title
source: Home Tab
pl: Aktualności

# Onboarding_home_tab_view_description
source: Here you can see posts created by other people. You can post your own content too, including photos!
pl: Tutaj możesz zobaczyć najnowszą aktywność innych, posty które udostępniają. Ponadto możesz dodać własne posty i to w dodatku ze zdjęciami!

# Onboarding_post_comments_title
source: Post's Comments
pl: Komentarze do postów

# Onboarding_post_comments_description
source: Comment other people's activity and motivate each other.
pl: Komentuj aktywność innych i wzajemnie motywujcie się do działania.

# Onboarding_search_friends_view_title
source: Following
pl: Obserwowanie

# Onboarding_search_friends_view_description
source: By searching throught the whole database of app's users, here you can follow anybody who has account on FitVein!
pl: Poprzez listę użytkowników, możesz wyszukać kogokolwiek chcesz i zacząć go obserwować by widzieć jego aktywność.

# Onboarding_workouts_view_title
source: Workout Tab
pl: Trening

# Onboarding_workouts_view_description
source: This is the root view of fundamental functionality of the app - doing exercises. You can choose from already created or create your own workouts.
pl: Tutaj się zaczyna najważniejsza funkcjonalność aplikacji - treningi. Wybierz jeden z już przygotowanych lub stwórz własny i rozpocznij ćwiczenie.

# Onboarding_add_workout_view_title
source: Add your own workout
pl: Dodaj swój własny trening

# Onboarding_add_workout_view_description
source: Just set desire number of series, both work and rest time and your own workout is created.
pl: Wystarczy ustawić liczbę rund, czas pracy i odpoczynku i twój własny trening jest gotowy.

# Onboarding_workout_timer_view_title
source: Timer
pl: Aktywny trening

# Onboarding_workout_timer_view_description
source: Here you can see the progress of the training you chose.
pl: Stąd masz pogląd na przebieg treningu - liczbę wykonanych rund oraz ich czas.

# Onboarding_finished_workout_view_title
source: Finished workout
pl: Ukończony trening

# Onboarding_finished_workout_view_description
source: The summary of the workout you have just completed including burned calories, time spent on workout and many more. You can save the workout or not if you fell you could have done better.
pl: Podsumowanie ukończonego przed chwilą treningu - jego parametry takie jak liczba spalonych kalorii czy poświęcony czas, a także wiele więcej. Trening możesz zapisać lub odrzucić jeśli czujesz, że słabo ci poszło.

# Onboarding_profile_view_title
source: Profile Tab
pl: Profil

# Onboarding_profile_view_description
source: Your personal information. You can add different profile picture by clicking on it. You can see there achieved medals for various completed activities along with health stats and completed workouts.
pl: Twoje najważniejsze informacje. Możesz dodać swoje inne zdjęcie profilowe klikając na nie. Zobaczysz tutaj także zdobyte medale oraz parametry zdrowotne i odbyte treningi.

# Onboarding_health_tab_view_title
source: Health parameters
pl: Parametry zdrowotne

# Onboarding_health_tab_view_description
source: Basic health parameters collected by your device are shown there, all in one place.
pl: Podstawowe dane dotyczące twojej aktywności, wszystkie zebrane w jednym miejscu

# Onboarding_workouts_tab_view_title
source: Completed workouts
pl: Ukończone treningi

# Onboarding_workouts_tab_view_description
source: Want to see the progress you made from workout to workout? Here you can find all the workouts you decided to save.
pl: Chciałbyś zobaczyć postęp dokonywany z treningu na trening? Tutaj jeszcze raz możesz obejrzeć wszystkie ukończone treningi, które zdecydowałeś się zapisać.

# Onboarding_workouts_tab_view_list_title
source: Completed workouts
pl: Ukończone treningi

# Onboarding_workouts_tab_view_list_description
source: You can see these workouts either in the windows form or the list.
pl: Treningi te możesz zobaczyć w trybie okien lub listy.

# Onboarding_settings_view_title
source: Settings
pl: Ustawienia

# Onboarding_settings_view_description
source: You want to personalize the app so that is fulfill your needs as much as it can? Here you can find all the settings. When you decide to change your login credentials, sign out or delete your account this is the place your should start from
pl: Wszelkie ustawienia aplikacji mogą być dostosowane tutaj. Jeśli zdecydujesz się zmienić dane logowania, wylogować się lub usunąć konto to jest miejsce od którego powinieneś zacząć.

# Onboarding_medal_view_title
source: Medals
pl: Medale

# Onboarding_medal_view_description
source: For various activities completed in the app you earn medals which can be seen in your Profile Tab along with the descriptions for what you got them.
pl: Za różne aktywności ukończone w aplikacji otrzymujesz medale, które mogą być przeglądane w twoim profilu razem z informacją za co zostały otrzymane.

# Onboarding_thanks_title
source: Thank You
pl: Dziękujemy

# Onboarding_thanks_description
source: For giving our app a try. We wish you the most pleasant experience as possible. Welcome to FitVein family!
pl: Za zainstalowanie naszej aplikacji. Mamy nadzieje, że spełni ona wszystkie twoje oczekiwania. Witaj w rodzinie FitVein!

# Onboarding_get_started_button
source: Get Started
pl: Rozpocznij

# SignInView_sign_in_form_label
source: Sign In Form
pl: Logowanie

# SignInView_password_label
source: Password
pl: Hasło

# SignInView_forgot_password_label
source: Forgot Password?
pl: Zapomniałeś hasła?

# SignInView_forgot_password_navigation_title
source: Forgot Password Form
pl: Przypomnij Hasło

# SignInView_forgot_password_email_label
source: E-mail address
pl: E-mail

# SignInView_forgot_password_text
source: Please provide your e-mail address so that we could send you recovery e-mail with instructions how to reset the password.
pl: Wpisz proszę swój adres e-mail abyśmy mogli wysłać Ci maila z instrukcjami odnośnie resetowania hasła.

# SignInView_forgot_password_send_recovery_email_button
source: Send Recovery E-mail
pl: Wyślij E-mail

# SignInView_forgot_password_send_recovery_email_error
source: Error sending recovery e-mail. Please check provided e-mail address.
pl: Błąd podczas wysyłania maila. Sprawdź proszę podany adres e-mail

# SignInView_forgot_password_send_recovery_email_success
source: Recovery e-mail has been sent. Please check your e-mail inbox.
pl: E-mail został wysłany. Sprawdź proszę skrzynkę odbiorczą.

# SignInView_sign_in_button
source: Sign In
pl: Zaloguj się

# SignInView_no_account_label
source: Don't have an account?
pl: Nie masz konta?

# SignInView_create_account_button
source: Create one
pl: Stwórz je

# SignInView_sign_in_wrong_data_label
source: Provided e-mail and/or password is incorrect or the account does not exists.
pl: Podany adres e-mail oraz hasło są niepoprawne lub konto nie istnieje.

# SignUpView_sign_up_form_label
source: Sign Up Form
pl: Rejestracja

# SignUpView_first_name_label
source: First Name
pl: Imię

# SignUpView_username_label
source: Username
pl: Nazwa użytkownika

# SignUpView_username_used_label
source: This username has already been used.
pl: Ta nazwa użytkownika jest już zajęta.

# SignUpView_gender_label
source: Gender
pl: Płeć

# SignUpView_birth_date_label
source: Birth Date
pl: Data urodzenia

# SignUpView_country_label
source: Country
pl: Kraj

# SignUpView_country_poland
source: Poland
pl: Polska

# SignUpView_language_label
source: Language
pl: Język

# SignUpView_language_english
source: English
pl: Angielski

# SignUpView_language_polish
source: Polish
pl: Polski

# SignUpView_next_button_label
source: Next
pl: Dalej

# SignUpView_email_label
source: E-mail address
pl: E-mail

# SignUpView_email_used_label
source: This e-mail has already been used.
pl: Ten adres e-mail jest już zajęty.

# SignUpView_password_label
source: Password
pl: Hasło

# SignUpView_password_hint_label
source: Password should be at least 8 characters long and should contain a number
pl: Hasło powinno mieć długość co najmniej 8 znaków i powinno zawierać cyfrę.

# SignUpView_repeat_password_label
source: Repeat Password
pl: Powtórz hasło

# SignUpView_sign_up_button_label
source: Sign Up
pl: Zarejestruj się

# SignUpView_error
source: Error signing up. Please try again later.
pl: Wystąpił błąd podczas rejestracji. Spróbuj proszę ponownie później.

# LoggedUserView_home_tab_label
source: Home
pl: Aktualności

# LoggedUserView_workout_tab_label
source: Workout
pl: Trening

# LoggedUserView_profile_tab_label
source: Profile
pl: Profil

# ContentView_welcome_label
source: Welcome!
pl: Witaj!

# ContentView_unlock_the_app_label
source: Unlock the app first
pl: Najpierw odblokuj aplikację

# HomeView_share
source: What do you want to share?
pl: Czym się chcesz podzielić?

# HomeView_friends_activity
source: Your friends activity
pl: Aktywność znajomych

# HomeView_post_comments_number
source: comments
pl: komentarzy

# HomeView_like_button
source: Like
pl: Lubię to

# HomeView_comment_button
source: Comment
pl: Skomentuj

# HomeView_confirmation_dialog_text
source: What do you want to do with the selected post?
pl: Co chcesz zrobić z wybranym postem?

# HomeView_confirmation_dialog_edit
source: Edit
pl: Edytuj

# HomeView_confirmation_dialog_delete
source: Delete
pl: Usuń

# HomeView_confirmation_dialog_cancel
source: Cancel
pl: Anuluj

# HomeView_nothing_to_present
source: Nothing new to present.
pl: Nie ma żadnych nowych aktualności.

# HomeView_add_friends_label
source: Follow other users to see their news.
pl: Obserwuj innych by widzieć ich aktualności.

# AddPostView_navigation_title
source: Add a post
pl: Dodaj post

# AddPostView_post_button
source: Post
pl: Opublikuj

# AddPostView_share
source: What do you want to share?
pl: Czym się chcesz podzielić?

# AddPostView_success
source: Post has been added successfully.
pl: Post został poprawnie dodany.

# AddPostView_error
source: Error adding post. Please, try again later.
pl: Błąd podczas dodawania posta. Spróbuj ponownie później.

# AddPostView_upload_photo
source: Upload photo
pl: Dodaj zdjęcie

# AddPostView_photo_selected
source: Photo selected
pl: Zdjęcie wybrane

# EditPostView_navigation_title
source: Edit a post
pl: Edytuj post

# EditPostView_save_button
source: Save
pl: Zapisz

# EditPostView_share
source: What do you want to share?
pl: Czym się chcesz podzielić?

# EditPostView_success
source: Successfully edited post.
pl: Post został pomyślnie edytowany.

# EditdPostView_error
source: Error editing post. Please try again later.
pl: Błąd podczas edytowania posta. Spróbuj ponownie później.

# EditPostView_upload_photo
source: Upload photo
pl: Dodaj zdjęcie

# EditPostView_photo_selected
source: Photo selected
pl: Zdjęcie wybrane

# EditPostView_change_photo
source: Change photo
pl: Zmień zdjęcie

# EditPostView_delete_photo
source: Delete photo
pl: Usuń zdjęcie

# SearchFriendsView_navigation_title
source: Follow
pl: Obserwowanie

# SearchFriendsView_follow_button
source: Follow
pl: Obserwuj

# SearchFriendsView_unfollow_button
source: Unfollow
pl: Odobserwuj

# NotificationsView_navigation_title
source: Notifications
pl: Powiadomienia

# CommentView_post_like_button
source: Like
pl: Lubię to

# CommentView_confirmation_dialog_text
source: What do you want to do with the selected comment?
pl: Co chcesz zrobić z wybranym komentarzem?

# CommentView_confirmation_dialog_edit
source: Edit
pl: Edytuj

# CommentView_confirmation_dialog_delete
source: Delete
pl: Usuń

# CommentView_confirmation_dialog_cancel
source: Cancel
pl: Anuluj

# CommentView_comment_text_field_label
source: Comment
pl: Skomentuj

# CommentView_send_comment_button
source: Send
pl: Wyślij

# CommentView_edit_comment_cancel_button
source: Cancel
pl: Anuluj

# CommentView_send_comment_update_button
source: Update
pl: Zmień

# CommentView_edit_comment_error
source: Error editing comment. Please, try again later.
pl: Błąd podczas edytowania komentarza. Spróbuj ponownie później.

# CommentView_comment_number_label
source: comments
pl: komentarzy

# WorkoutView_navigation_title
source: Workouts
pl: Treningi

# WorkoutView_sample_workouts
source: Sample Workouts
pl: Treningi przykładowe

# WorkoutView_interval_training_type
source: Interval
pl: Interwał

# WorkoutView_interval_work_time
source: Work Time
pl: Praca

# WorkoutView_interval_rest_time
source: Rest Time
pl: Odpoczynek

# WorkoutView_interval_series
source: Series
pl: Serie

# WorkoutView_users_workouts
source: User's Workouts
pl: Treningi użytkownika

# WorkoutAddView_navigation_title
source: Add Workout
pl: Dodaj trening

# WorkoutAddView_interval_rounds_number
source: Rounds Number
pl: Liczba serii

# WorkoutAddView_interval_rounds_unit
source: number
pl: liczba

# WorkoutAddView_interval_work_time
source: Work Time
pl: Praca

# WorkoutAddView_interval_work_time_unit
source: seconds
pl: sekundy

# WorkoutAddView_interval_rest_time
source: Rest Time
pl: Odpoczynek

# WorkoutAddView_interval_rest_time_unit
source: seconds
pl: sekundy

# WorkoutAddView_save_workout_button
source: Save Workout
pl: Zapisz

# WorkoutTimerView_work_label
source: Work
pl: Praca

# WorkoutTimerView_rest_label
source: Rest
pl: Odpoczynek

# WorkoutTimerView_elapsed_time
source: Elapsed
pl: Upłynęło

# WorkoutTimerView_rounds
source: Rounds
pl: Serie

# WorkoutTimerView_remaining
source: Remaining
pl: Pozostało

# FinishedWorkoutView_save_button
source: Save
pl: Zapisz

# FinishedWorkoutView_discard_button
source: Discard
pl: Odrzuć

# FinisehdWorkoutView_saving_error
source: Cannot save the workout right now. Please try again later.
pl: Nie można teraz zapisać treningu. Spróbuj ponownie później

# SingleWorkoutWindowsView_interval_training_type
source: Interval
pl: Interwał

# SingleWorkoutWindowsView_workout_details
source: Workout Summary
pl: Podsumowanie treningu

# SingleWorkoutWindowsView_duration
source: Duration
pl: Czas trwania

# SingleWorkoutWindowsView_calories
source: Calories
pl: Kalorie

# SingleWorkoutWindowsView_calories_unit
source: cal
pl: kcal

# SingleWorkoutWindowsView_work_time
source: Work Time
pl: Praca

# SingleWorkoutWindowsView_work_time_unit
source: seconds
pl: sekund

# SingleWorkoutWindowsView_rest_time
source: Rest Time
pl: Odpoczynek

# SingleWorkoutWindowsView_rest_time_unit
source: seconds
pl: sekund

# SingleWorkoutWindowsView_series
source: Series
pl: Serie

# ProfileView_change_photo_confirmation_dialog_text
source: Add a new photo
pl: Dodaj nowe zdjęcie

# ProfileView_change_photo_confirmation_dialog_take_photo_button
source: Take a new photo
pl: Zrób zdjęcie

# ProfileView_change_photo_confirmation_dialog_upload_photo_button
source: Upload a new photo
pl: Załaduj zdjęcie

# ProfileView_change_photo_confirmation_dialog_cancel_button
source: Cancel
pl: Anuluj

# ProfileView_level_label
source: Level
pl: Poziom

# ProfileView_workouts_label
source: Workouts
pl: Treningów

# ProfileView_no_workouts_message
source: Go to 'Workout' Tab to do your first training!
pl: Przejdź do zakładki 'Trening' żeby zrobić swój pierwszy trening!

# ProfileView_level_up
source: Level Up!
pl: Nowy poziom!

# ProfileView_medal_first_level
source: Create an account
pl: Stwórz konto

# ProfileView_medal_second_level
source: Achieve level 2
pl: Osiągnij poziom 2

# ProfileView_medal_third_level
source: Achieve level 3
pl: Osiągnij poziom 3

# ProfileView_medal_first_post
source: Publish your first post
pl: Opublikuj swój pierwszy post

# ProfileView_medal_first_comment
source: Add your first comment
pl: Dodaj swój pierwszy komentarz

# ProfileView_medal_first_like
source: Give your first like
pl: Użyj opcji polubień

# ProfileView_medal_first_workout
source: Complete your first workout
pl: Ukończ swój pierwszy trening

# ProfileView_medal_first_own_workout
source: Create your own workout
pl: Stwórz swój pierwszy własny trening

# SettingsView_navigation_title
source: Settings
pl: Ustawienia

# SettingsView_app_settings_section
source: App
pl: Aplikacja

# SettingsView_notifications_toggle_label
source: Notifications
pl: Powiadomienia

# SettingsView_sample_workouts_toggle_label
source: Show 'Sample Workouts' in Workout Tab
pl: Pokaż 'Treningi przykładowe' w zakładce 'Treningi'

# SettingsView_animations_health_tab_view_toggle_label
source: Show animations in health section of your profile
pl: Pokaż animacje w sekcji zdrowie twojego profilu

# SettingsView_faceID_touchID_toggle_label
source: Use FaceID / TouchID
pl: Używaj FaceID / TouchID

# SettingsView_faceID_touchID_info_label
source: Whether FaceID or TouchID is used depends on device hardware capabilities
pl: Użycie FaceID lub TouchID zależy od technicznych możliwości urządzenia

# SettingsView_account_settings_section
source: Account
pl: Konto

# SettingsView_change_email_address_button
source: Change e-mail address
pl: Zmień adres e-mail

# ChangeEmailSheet_old_email_address
source: Old e-mail address
pl: Stary adres e-mail

# ChangeEmailSheet_password
source: Password
pl: Hasło

# ChangeEmailSheet_new_email_address
source: New e-mail address
pl: Nowy adres e-mail

# ChangeEmailSheet_info
source: Before you change your e-mail address please provide your login credentials to confirm it is really you
pl: Przed zmianą adresu e-mail podaj proszę swoje dane logowania, żebyśmy mogli potwierdzić, że to rzeczywiście ty.

# ChangeEmailSheet_change_email_address_button
source: Change e-mail address
pl: Wprowadź zmianę

# ChangeEmailSheet_change_email_error
source: Error changing e-mail address. Please, try again later.
pl: Wystąpił błąd przy zmianie adresu e-mail. Spróbuj ponownie później.

# ChangeEmailSheet_change_email_success
source: Successfully changed e-mail address.
pl: Pomyślnie zmieniono adres e-mail.

# SettingsView_change_password_button
source: Change password
pl: Zmień hasło

# ChangePasswordSheet_email_address
source: E-mail address
pl: Adres e-mail

# ChangePasswordSheet_old_password
source: Old password
pl: Stare hasło

# ChangePasswordSheet_new_password
source: New password
pl: Nowe hasło

# ChangePasswordSheet_info
source: Before you change your password please provide your login credentials to confirm it is really you
pl: Przed zmianą hasła podaj proszę swoje dane logowania, żebyśmy mogli potwierdzić, że to rzeczywiście ty.

# ChangePasswordSheet_change_password_button
source: Change password
pl: Wprowadź zmianę

# ChangePasswordSheet_change_password_error
source: Error changing password. Please, try again later.
pl: Wystąpił błąd przy zmianie hasła. Spróbuj ponownie później.

# ChangePasswordSheet_change_password_success
source: Successfully changed password.
pl: Pomyślnie zmieniono hasło.

# SettingsView_logout
source: Logout
pl: Wyloguj się

# SettingsView_logout_confirmation_dialog_text
source: Are you sure you want to logout?
pl: Czy jesteś pewny/a, że chcesz się wylogować?

# SettingsView_logout_confirmation_dialog_logout_button
source: Logout
pl: Wyloguj się

# SettingsView_logout_confirmation_dialog_cancel_button
source: Cancel
pl: Anuluj

# SettingsView_delete_account
source: Delete account
pl: Usuń konto

# SettingsView_delete_account_confirmation_dialog_text
source: Are you sure you want to delete your account? All data will be lost.
pl: Czy jesteś pewny/a, że chcesz usunąć konto? Wszystkie dane zostaną utracone.

# SettingsView_delete_account_confirmation_dialog_delete_account_button
source: Delete Account
pl: Usuń konto

# SettingsView_delete_account_confirmation_dialog_cancel_button
source: Cancel
pl: Anuluj

# DeleteAccountSheet_email_address
source: E-mail address
pl: Adres e-mail

# DeleteAccountSheet_password
source: Password
pl: Hasło

# DeleteAccountSheet_info
source: Before you delete your account please provide your login credentials to confirm it is really you
pl: Przed usunięciem konta podaj proszę swoje dane logowania, żebyśmy mogli potwierdzić, że to rzeczywiście ty.

# DeleteAccountSheet_delete_account_button
source: Delete account permanently
pl: Usuń konto nieodwracalnie

# DeleteAccountSheet_delete_account_error
source: Error deleting the user's account. Please, try again later.
pl: Wystąpił błąd przy usuwaniu konta. Spróbuj ponownie później.

# SettingsView_help_settings_section
source: Help
pl: Pomoc

# SettingsView_version_label
source: Version (build)
pl: Wersja (kompilacja)

# SettingsView_terms_and_conditions_settings_label
source: Terms and Conditions
pl: Zasady i warunki

# SettingsView_terms_and_conditions_navigation_title
source: Terms and Conditions
pl: Zasady i warunki

# SettingsView_terms_and_conditions_text
source: This app is a fully open-source and licence-free product
pl: Ta aplikacja jest w pełni otwartym i wolnym oprogramowaniem

# SettingsView_help_settings_label
source: Help
pl: Pomoc

# SettingsView_help_navigation_title
source: Help
pl: Pomoc

# SettingsView_help_text
source: In case of any problems please write an e-mail to following email describing the issue:
pl: W razie jakichkolwiek problemów napisz maila na poniższy adres opisując problem:

# SettingsView_onboarding_label
source: App's guide
pl: Przewodnik aplikacji

# SettingsView_github_author_following
source: Follow me on GitHub:
pl: Odwiedź mój GitHub:

# HealthTabView_navigation_title
source: Health Data
pl: Dane zdrowotne

# HealthTabView_steps
source: Steps
pl: Kroki

# HealthTabView_calories
source: Calories
pl: Kalorie

# HealthTabView_distance
source: Distance
pl: Dystans

# HealthTabView_workout_time
source: Workout Time
pl: Czas treningu

# HealthTabView_pulse
source: Pulse
pl: Tętno

# WorkoutTabView_windows_navigation_title
source: Workout
pl: Treningi

# WorkoutTabView_list_single_workout_navigation_title
source: Workout
pl: Trening

# WorkoutTabView_list_navigation_title
source: Workouts
pl: Treningi

# WorkoutTabView_list_workout_type_name
source: Interval
pl: Interwał
